# Виселица

# Классическая игра "виселица". Компьютер случайным образом выбирает слово.
# которое игрок должен отгадать буква за буквой. Если игрок не сумеет
# отгадать за отведенное кол-во попыток, на экране появится фигурка повешенного.

# Импорт модуля

import random

# Константы

HANGMAN = (
    """
        -------
        |     |
        |
        |
        |
        |
        |
        |
        |
      -------------
    """,
    """
        -------
        |     |
        |     0    |
        |
        |
        |
        |
        |
        |
      -------------
    """,
    """
        -------
        |     |
        |     0    |    -+-
        |
        |
        |
        |
        |
        |
      -------------
    """,
    """
        -------
        |     |
        |     0    |    /-+-
        |
        |
        |
        |
        |
        |
      -------------
    """,
    """
        -------
        |     |
        |     0    |    /-+-/
        |
        |
        |
        |
        |
        |
      -------------
    """,
    """
        -------
        |     |
        |     0    |    /-+-/
        |     |
        |
        |
        |
        |
        |
      -------------
    """,
    """
        -------
        |     |
        |     0    |    /-+-/
        |     |
        |     |
        |   |
        |   |
        |
        |
      -------------
    """,
    """
        -------
        |     |
        |     0    |    /-+-/
        |     |
        |     |
        |   |   |
        |   |   |
        |
        |
      -------------
    """)

MAX_WRONG = len(HANGMAN) - 1

choice = None

print(
    """
    0 - Выход
    1 = Выбор языка
    """
)

while choice != "0":
    choice = input("\nВыберете один из вариантов: ")
    if choice == "1":
        print("Выберете один из языков:")
        print(
        """1
        
        1 - RUS
        2 - ENG
        """
        )
        language = input("Ваш выбор: ")
        if language == "1":
            WORDS = ("СТОЛ", "СТУЛ", "КАБИНЕТ", "КОМПЬЮТЕР")
        else:
            WORDS = ("PYTHON", "GITHUB", "COMPUTER", "PHONE", "HANGMAN")

    elif choice == "0":
        print("До свидания!")
    break

# Инициализация переменных

word = random.choice(WORDS)  # Слово для отгадывания
so_far = "-" * len(word)  # По одному дефису на каждую букву, которую надо отгадать
wrong = 0  # Кол-во ошибок, которые сделал игрок
used = []  # Буквы, которые игрок уже предлагал

print("Добро пожаловать в игру 'Виселица'. Удачи вам!")
while wrong < MAX_WRONG and so_far != word:
    print(HANGMAN[wrong])
    print("\nВы уже предлагали следующие буквы:\n", used)
    print("\nОтгаданное вами в слове сейчас выглядит так:\n", so_far)

    guess = input("\n\nВведите букву: ")
    guess = guess.upper()
    while guess in used:
        print("Вы предлагали букву", guess)
        guess = input("\n\nВведите букву: ")
        guess.upper()
    used.append(guess)

    if guess in word:
        print("\nДа! Буква", guess, "есть в слове!")

        # Новая строка so_far с отгаданной буквой или буквами

        new = ""
        for i in range(len(word)):
            if guess == word[i]:
                new += guess
            else:
                new += so_far[i]
        so_far = new
    else:
        print("\nК сожалению, буквы", guess, "нет в слове.")
        wrong += 1

if wrong == MAX_WRONG:
    print(HANGMAN[wrong])
    print("\nВас повесили!")
else:
    print("nВы отгадали!")
print("\nБыло загадано слово:", word)

input("\n\n1"
      "Нажмите Enter, чтобы выйти.")
