# Забавные строки

# Демонстрирует сцепление и повторение строк

print("Две строки можно " + "сцепить с помощью оператора \"+\".")
print("\nЭта строка " + "вряд ли " + "удив" + "ит вас. " \
      + "Но интересно, " + "что" + " она - \n" + "одна длинная-длин" \
      + "на" + "я" + " строка, сцепленная " \
      + "из" + "двадцати двух\n" + "отдельных строк, разбитых " \
      + "на шесть строк." + " Достаточно ли вы" + " впечатлены? " + "Ну хватит,\n" \
      + "вот " + "наша " + "длинная" + " строка и закончилась!")

print("Пирожные" * 10)
input("\n\nНажмите Enter, чтобы выйти.")
